Repository: gilad2905/treesha
Catalog: lib/l10n/app_*.arb
Languages: he, ru

# fruitTypeOlive
source: Olive
he: ת
ru: Олива

# fruitTypeAlmond
source: Almond
he: שק
ru: Миндаль

# fruitTypeCarobHaruv
source: Carob (Haruv)
he: ר
ru: Рожковое дерево (Харув)

# fruitTypeMulberryWhite
source: Mulberry (White)
he: תת עץ ()
ru: Шелковица (Белая)

# fruitTypeMulberryBlack
source: Mulberry (Black)
he: תת עץ (שר)
ru: Шелковица (Черная)

# fruitTypePear
source: Pear
he: ס
ru: Груша

# fruitTypeJujubeShizaf
source: Jujube (Shizaf)
he: שף
ru: Унаби (Шизаф)

# fruitTypeMedlar
source: Medlar
he: שסק רפ (ר)
ru: Мушмула

# fruitTypeChestnut
source: Chestnut
he: ער
ru: Каштан

# fruitTypePapaya
source: Papaya
he: פפ
ru: Папайя

# fruitTypeDragonFruitPitaya
source: Dragon Fruit (Pitaya)
he: פר רק (פ)
ru: Питайя (Драконий фрукт)

# fruitTypeJackfruit
source: Jackfruit
he: 'קפר
ru: Джекфрут

# fruitTypeLongan
source: Longan
ru: Лонган

source: Sign In
he: תר
ru: Войти

source: Sign Out
he: תתק
ru: Выйти

# addTree
source: Add a New Tree
he: סף עץ ש
ru: Добавить дерево

source: Tree Name
he: ש עץ
ru: Название дерева

source: Fruit Type
he: ס פר
ru: Тип фрукта

# searchFruitType
source: Search for fruit type
he: פש ס פר
ru: Поиск типа фрукта

source: Add Image
he: סף ת
ru: Добавить фото

source: No image selected
he: ר ת
ru: Фото не выбрано

source: Cancel
ru: Отмена

source: Add
he: סף
ru: Добавить

# pleaseEnterTreeName
source: Please enter a tree name
he: ש עץ
ru: Введите название дерева

# pleaseEnterFruitType
source: Please enter a fruit type
he: ס פר
ru: Введите тип фрукта

# pleaseSelectValidFruit
source: Please select a valid fruit type from the list
he: ר ס פר תק רש
ru: Выберите тип фрукта из списка

source: 🌳 Tree added successfully!
he: עץ סף צ!
ru: 🌳 Дерево успешно добавлено!

# pleaseSignInToAddTree
source: Please sign in to add a tree
he: תר סף עץ
ru: Войдите, чтобы добавить дерево

# verificationScore
source: Verification Score: {score}
he: צ ת: {score}
ru: Рейтинг проверки: {score}

# voteUpdated
source: Vote updated! Close and reopen to see changes.
he: צע ע! סר פת ש רת ש.
ru: Голос обновлен! Переоткройте, чтобы увидеть изменения.

# errorUpvoting
source: Error upvoting: {error}
he: ש צע ע: {error}
ru: Ошибка голосования ЗА: {error}

# errorDownvoting
source: Error downvoting: {error}
he: ש צע : {error}
ru: Ошибка голосования ПРОТИВ: {error}

# treeNameLabel
source: Tree Name: {name}
he: ש עץ: {name}
ru: Название: {name}

# fruitTypeLabel
source: Fruit Type: {type}
he: ס פר: {type}
ru: Тип фрукта: {type}

# location
source: Location: Lat {lat}, Lng {lng}
he: ק: ק ר {lat}, ק ר {lng}
ru: Локация: Шир. {lat}, Долг. {lng}

# addedOn
source: Added on: {date}
he: סף תר: {date}
ru: Добавлено: {date}

# minimumVerificationScore
source: Minimum Verification Score: {score}
he: צ ת : {score}
ru: Мин. рейтинг проверки: {score}

source: Something went wrong
he: ש שתש
ru: Что-то пошло не так

source: Language
he: שפ
ru: Язык

source: Russian
ru: Русский

source: Filters
he: ס
ru: Фильтры

# verificationScoreFilter
source: Verification Score
he: צ ת
ru: Рейтинг проверки

source: More filters coming soon...
he: ס ספ קר...
ru: Другие фильтры скоро появятся...

source: Reset
he: פס
ru: Сбросить

source: Apply
ru: Применить

# statusPending
source: Pending
he: ת שר
ru: Ожидает

# statusApproved
source: Approved
he: שר
ru: Одобрено

# statusRejected
source: Rejected
ru: Отклонено

source: Navigate
ru: Маршрут

source: Comment (optional)
he: ער (פצ)
ru: Комментарий (опционально)

# addCommentHint
source: Add a comment...
he: סף ער...
ru: Добавить комментарий...

# photos
source: Photos ({count})
he: תת ({count})
ru: Фото ({count})

source: Add Photos
he: סף תת
ru: Добавить фото

source: Report Content
he: ע ת
ru: Пожаловаться

# reportConfirmation
source: Are you sure you want to report this tree? Our team will review it.
he: ת שרצ ע עץ ? צת ש ק ת.
ru: Вы уверены, что хотите пожаловаться? Мы проверим это дерево.

source: Report
ru: Пожаловаться

# reportSubmitted
source: Report submitted. Thank you!
he: ש. ת!
ru: Жалоба отправлена. Спасибо!

source: Share
he: שתף
ru: Поделиться

# shareText
source: Check out this {fruit} tree on Treez!
he: תר ת עץ {fruit} -Treez!
ru: Посмотрите на это дерево ({fruit}) в приложении Treez!

# addCommentPhotos
source: Add Photos/Comment
he: סף תת/ער
ru: Добавить фото/комментарий

# zoomCloser
source: Zoom closer for better accuracy 🔎
he: תקר פ ק ר
ru: Приблизьте карту для точности 🔎

# longClickToAdd
source: Long-click on the exact position of the tree to add it
he: ספ ץ צ ר ע ק ק
ru: Удерживайте палец на месте дерева, чтобы добавить его

source: Update Required
he: רש ע רס
ru: Требуется обновление

source: Update Now
he: ע עש
ru: Обновить сейчас

source: Later
he: ר
ru: Позже

source: Anonymous
ru: Аноним

# currentVersionLabel
source: Current version: {version}
he: רס ת: {version}
ru: Текущая версия: {version}

# minVersionLabel
source: Minimum version: {version}
he: רסת : {version}
ru: Мин. версия: {version}

# failedToAddTree
source: Failed to add tree: {error}
he: ספת עץ ש: {error}
ru: Не удалось добавить дерево: {error}

# failedToSaveTree
source: Failed to save tree. Please try again.
he: שרת עץ ש. ס ש.
ru: Не удалось сохранить дерево. Попробуйте еще раз.

# unexpectedError
source: An unexpected error occurred: {error}
he: רע ש ת צפ: {error}
ru: Произошла непредвиденная ошибка: {error}

# pleaseWait
source: Please wait for the tree to be saved
he: ת ע שרת עץ
ru: Пожалуйста, подождите, пока дерево сохраняется

source: No fruit types available
he: ס פרת
ru: Типы фруктов не найдены

# statusFilter
source: Status
he: סס
ru: Статус

source: Last Verified After
he: ת ר ר
ru: Проверено после

source: No date filter
he: ס פ תר
ru: Без фильтра по дате

source: Added After
he: סף ר
ru: Добавлено после

source: Show Reported Only
he: צ
ru: Только с жалобами

# filterReportedSubtitle
source: Filter trees flagged by users
he: ס עצ ש ע שתש
ru: Показать деревья, на которые жаловались

source: Show Unknown Fruits Only
he: צ פרת ע
ru: Только неизвестные фрукты

# filterUnknownFruitsSubtitle
source: Filter fruits not in the official list
he: ס פרת ש רש רשת
ru: Показать фрукты не из списка

# loginToAddPhotos
source: You need to be logged in to add photos or comments
he: ע תר סף תת ערת
ru: Войдите, чтобы добавить фото или комментарии

source: Post added successfully
he: פס סף צ
ru: Комментарий успешно добавлен

# loginToReport
source: You need to be logged in to report
he: ע תר
ru: Войдите, чтобы пожаловаться

source: Delete Tree
he: ק עץ
ru: Удалить дерево

# deleteTreeConfirmation
source: Are you sure you want to delete this tree and all its posts? This action cannot be undone.
he: ת שרצ ק ת עץ ת פס ש? פע תת .
ru: Вы уверены, что хотите удалить дерево и все записи? Это действие необратимо.

source: Tree deleted successfully
he: עץ ק צ
ru: Дерево удалено

source: Post deleted successfully
he: פס ק צ
ru: Запись удалена

# deleteTreeTooltip
source: Delete tree
he: ק עץ
ru: Удалить дерево

# reportTooltip
source: Report this content
he: ע ת
ru: Пожаловаться

# loginToVerify
source: You need to be logged in to verify trees
he: ע תר ת עצ
ru: Войдите, чтобы подтверждать деревья

# loginToUnverify
source: You need to be logged in to unverify trees
he: ע תר ת עצ
ru: Войдите, чтобы отклонять деревья

source: Added {date}
he: סף תר {date}
ru: Добавлено {date}

source: Last verified: {date}
he: ת ר: {date}
ru: Проверено: {date}

# noPhotosOrComments
source: No photos or comments yet
he: ע תת ערת
ru: Фото и комментариев пока нет

source: Be the first to share!
he: רש שתף!
ru: Будьте первым!

source: Delete Post
he: ק פס
ru: Удалить запись

# deletePostConfirmation
source: Are you sure you want to delete this post?
he: ת שרצ ק ת פס ?
ru: Вы уверены, что хотите удалить эту запись?

source: Posting...
he: ע...
ru: Публикация...

# createdBy
source: Created by {name}
ru: Добавил: {name}

# disclaimerTitle
source: 🌿 Foraging & Use Disclaimer
ru: 🌿 Отказ от ответственности при сборе и использовании

# disclaimerSubtitle
source: Important Notice
ru: Важное примечание

# disclaimerAgreement
source: This app provides user-generated information about trees, herbs, and other plants that may be edible. The content in this app is for informational purposes only. By using this app, you acknowledge and agree that:
ru: Это приложение предоставляет созданную пользователями информацию о деревьях, травах и других растениях, которые могут быть съедобными. Контент в этом приложении предназначен только для информационных целей. Используя это приложение, вы подтверждаете и соглашаетесь с тем, что:

# disclaimerPoint1Title
source: 🌱 Plant identification is your responsibility.
ru: 🌱 Идентификация растений — это ваша ответственность.

# disclaimerPoint1Body
source: Always independently verify the identity of any plant before consuming it. Many edible plants have toxic look-alikes.
ru: Всегда самостоятельно проверяйте идентичность любого растения перед его употреблением. У многих съедобных растений есть ядовитые двойники.

# disclaimerPoint2Title
source: ⚠️ Do not consume any fruit, herb, or plant unless you are absolutely certain it is safe.
ru: ⚠️ Не употребляйте никакие фрукты, травы или растения, если вы не уверены на 100% в их безопасности.

# disclaimerPoint2Body
source: When in doubt, do not eat it.
ru: Если сомневаетесь — не ешьте.

# disclaimerPoint3Title
source: 🏡 Respect private property.
ru: 🏡 Уважайте частную собственность.

# disclaimerPoint3Body
source: Do not enter private land without permission. You are solely responsible for ensuring you have legal access to any location.
ru: Не заходите на частную территорию без разрешения. Вы несете единоличную ответственность за обеспечение законного доступа к любому месту.

# disclaimerPoint4Title
source: 🧪 Health & safety risks.
ru: 🧪 Риски для здоровья и безопасности.

# disclaimerPoint4Body
source: Some plants may cause allergic reactions or adverse health effects. The app does not provide medical advice.
ru: Некоторые растения могут вызывать аллергические реакции или неблагоприятные последствия для здоровья. Приложение не дает медицинских консультаций.

# disclaimerPoint5Title
source: 👥 User-generated content.
ru: 👥 Пользовательский контент.

# disclaimerPoint5Body
source: Locations, descriptions, and edibility information are submitted by users and may be inaccurate, incomplete, or outdated.
ru: Местоположения, описания и информация о съедобности предоставляются пользователями и могут быть неточными, неполными или устаревшими.

# disclaimerLiability
source: The app owners, developers, and contributors assume no responsibility or liability for any injury, illness, damage, legal issues, or loss resulting from the use of this app or reliance on its content.
ru: Владельцы приложения, разработчики и участники не несут никакой ответственности за любые травмы, болезни, ущерб, юридические проблемы или убытки, возникшие в результате использования этого приложения или доверия к его контенту.

# disclaimerRisk
source: Use at your own risk.
ru: Используйте на свой страх и риск.

source: I understood
ru: Я понимаю

# appTitle
source: Treez
he: ר

# hebrew
source: עברית
he: ערת
